#### `terraform plan` Success for `deployments/`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_iam_role.example[0] will be updated in-place
~ resource "aws_iam_role" "example" {
        arn                   = "arn:aws:iam::595072229124:role/orbis/neo"
        assume_role_policy    = jsonencode(
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::595072229124:role/elzwhere"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        create_date           = "2020-05-02T13:18:49Z"
        force_detach_policies = false
        id                    = "neo"
        max_session_duration  = 3600
        name                  = "neo"
        path                  = "/orbis/"
      ~ tags                  = {
          + "Application" = "orbis"
          + "Customer"    = "iStreamPlanet"
          + "Environment" = "dev"
          + "Team"        = "dtc"
        }
        unique_id             = "AROAYVDIRT4CDKKBJZXW2"
    }

  # aws_iam_role.example[1] will be updated in-place
~ resource "aws_iam_role" "example" {
        arn                   = "arn:aws:iam::595072229124:role/orbis/trinity"
        assume_role_policy    = jsonencode(
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::595072229124:role/elzwhere"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        create_date           = "2020-05-02T13:18:49Z"
        force_detach_policies = false
        id                    = "trinity"
        max_session_duration  = 3600
        name                  = "trinity"
        path                  = "/orbis/"
      ~ tags                  = {
          + "Application" = "orbis"
          + "Customer"    = "iStreamPlanet"
          + "Environment" = "dev"
          + "Team"        = "dtc"
        }
        unique_id             = "AROAYVDIRT4CLO2UFYUQU"
    }

  # aws_iam_role.example[2] will be updated in-place
~ resource "aws_iam_role" "example" {
        arn                   = "arn:aws:iam::595072229124:role/orbis/morpheus"
        assume_role_policy    = jsonencode(
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::595072229124:role/elzwhere"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        create_date           = "2020-05-02T13:18:49Z"
        force_detach_policies = false
        id                    = "morpheus"
        max_session_duration  = 3600
        name                  = "morpheus"
        path                  = "/orbis/"
      ~ tags                  = {
          + "Application" = "orbis"
          + "Customer"    = "iStreamPlanet"
          + "Environment" = "dev"
          + "Team"        = "dtc"
        }
        unique_id             = "AROAYVDIRT4CPX3TPCRZB"
    }

  # aws_s3_bucket.example-dtc-bucket will be created
+ resource "aws_s3_bucket" "example-dtc-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "some-dumb-dtc-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Application" = "orbis"
          + "Customer"    = "iStreamPlanet"
          + "Environment" = "dev"
          + "Team"        = "dtc"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Build`, Action: `self2`*